
target/thumbv7em-none-eabi/release/nucleo-rtic-blinking-led:     file format elf32-little

Contents of the .debug_loc section:

    Offset   Begin            End              Expression
    00000000 ffffffff 0800022e (base address)
    00000008 0800022e 08000230 (DW_OP_reg0 (r0))
    00000013 08000230 0800023e (DW_OP_GNU_entry_value: (DW_OP_reg0 (r0)); DW_OP_stack_value)
    00000021 <End of list>
    00000029 ffffffff 0800022e (base address)
    00000031 0800022e 08000230 (DW_OP_reg1 (r1))
    0000003c 08000230 0800023e (DW_OP_reg0 (r0))
    00000047 <End of list>
    0000004f ffffffff 08000240 (base address)
    00000057 08000244 08000250 (DW_OP_lit1; DW_OP_stack_value)
    00000063 0800025c 0800026c (DW_OP_lit0; DW_OP_stack_value)
    0000006f <End of list>
    00000077 ffffffff 08000240 (base address)
    0000007f 08000250 08000252 (DW_OP_reg0 (r0); DW_OP_piece: 4; DW_OP_reg1 (r1); DW_OP_piece: 4)
    0000008f 0800025c 0800026c (DW_OP_reg0 (r0); DW_OP_piece: 4; DW_OP_reg1 (r1); DW_OP_piece: 4)
    0000009f 08000282 08000288 (DW_OP_reg0 (r0); DW_OP_piece: 4)
    000000ac 08000290 080002f4 (DW_OP_piece: 4; DW_OP_reg1 (r1); DW_OP_piece: 4)
    000000bb <End of list>
    000000c3 ffffffff 08000240 (base address)
    000000cb 08000252 0800025c (DW_OP_breg12 (r12): 32; DW_OP_stack_value)
    000000d8 <End of list>
    000000e0 ffffffff 08000240 (base address)
    000000e8 08000252 0800025c (DW_OP_breg12 (r12): 32; DW_OP_stack_value)
    000000f5 <End of list>

   3      DW_TAG_base_type    [no children]
    DW_AT_byte_size    DW_FORM_data1
    DW_AT_encoding     DW_FORM_data1
    DW_AT_name         DW_FORM_string
    DW_AT value: 0     DW_FORM value: 0
   4      DW_TAG_variable    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT_external     DW_FORM_flag_present
    DW_AT_declaration  DW_FORM_flag_present
    DW_AT value: 0     DW_FORM value: 0
   5      DW_TAG_subprogram    [has children]
    DW_AT_external     DW_FORM_flag_present
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_prototyped   DW_FORM_flag_present
    DW_AT_type         DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_frame_base   DW_FORM_exprloc
    DW_AT_GNU_all_call_sites DW_FORM_flag_present
    DW_AT_sibling      DW_FORM_ref4
    DW_AT value: 0     DW_FORM value: 0
   6      DW_TAG_formal_parameter    [no children]
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_type         DW_FORM_ref4
    DW_AT_location     DW_FORM_exprloc
    DW_AT value: 0     DW_FORM value: 0
   7      DW_TAG_subprogram    [has children]
    DW_AT_external     DW_FORM_flag_present
    DW_AT_name         DW_FORM_strp
    DW_AT_decl_file    DW_FORM_data1
    DW_AT_decl_line    DW_FORM_data1
    DW_AT_decl_column  DW_FORM_data1
    DW_AT_prototyped   DW_FORM_flag_present
    DW_AT_type         DW_FORM_ref4
    DW_AT_low_pc       DW_FORM_addr
    DW_AT_high_pc      DW_FORM_data4
    DW_AT_frame_base   DW_FORM_exprloc
    DW_AT_GNU_all_call_sites DW_FORM_flag_present
    DW_AT value: 0     DW_FORM value: 0

Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x800f (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0xfa7e): clang LLVM (rustc version 1.51.0-nightly (04caa632d 2021-01-30))
    <10>   DW_AT_language    : 28	(Rust)
    <12>   DW_AT_name        : (indirect string, offset: 0xc496): src/main.rs
    <16>   DW_AT_stmt_list   : 0x0
    <1a>   DW_AT_comp_dir    : (indirect string, offset: 0x6d5): /home/niklas/Desktop/exjobb/nucleo64-rtic-examples/target/thumbv7em-none-eabi/release/deps
    <1e>   DW_AT_GNU_pubnames: 1
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_ranges      : 0x2730
 <1><26>: Abbrev Number: 2 (DW_TAG_variable)
    <27>   DW_AT_name        : (indirect string, offset: 0x9c1e): vtable
    <2b>   DW_AT_type        : <0x35>
    <2f>   DW_AT_location    : 5 byte block: 3 bc 12 0 8 	(DW_OP_addr: 80012bc)
 <1><35>: Abbrev Number: 3 (DW_TAG_structure_type)
    <36>   DW_AT_containing_type: <0x40>
    <3a>   DW_AT_name        : (indirect string, offset: 0x9c1e): vtable
    <3e>   DW_AT_byte_size   : 0
    <3f>   DW_AT_alignment   : 4
 <1><40>: Abbrev Number: 4 (DW_TAG_base_type)
    <41>   DW_AT_name        : (indirect string, offset: 0xf291): ()
    <45>   DW_AT_encoding    : 7	(unsigned)
    <46>   DW_AT_byte_size   : 0
 <1><47>: Abbrev Number: 5 (DW_TAG_variable)
    <48>   DW_AT_name        : (indirect string, offset: 0x9c1e): vtable
    <4c>   DW_AT_type        : <0x50>
 <1><50>: Abbrev Number: 3 (DW_TAG_structure_type)
    <51>   DW_AT_containing_type: <0x65>
    <55>   DW_AT_name        : (indirect string, offset: 0x9c1e): vtable
    <59>   DW_AT_byte_size   : 0
    <5a>   DW_AT_alignment   : 4
 <1><5b>: Abbrev Number: 6 (DW_TAG_namespace)
    <5c>   DW_AT_name        : (indirect string, offset: 0xc4a2): core
 <2><60>: Abbrev Number: 6 (DW_TAG_namespace)
    <61>   DW_AT_name        : (indirect string, offset: 0x8901): convert
 <3><65>: Abbrev Number: 7 (DW_TAG_structure_type)
    <66>   DW_AT_name        : (indirect string, offset: 0xe147): Infallible
    <6a>   DW_AT_byte_size   : 0
    <6b>   DW_AT_alignment   : 1
 <4><6c>: Abbrev Number: 8 (DW_TAG_variant_part)
 <4><6d>: Abbrev Number: 0
 <3><6e>: Abbrev Number: 6 (DW_TAG_namespace)
    <6f>   DW_AT_name        : (indirect string, offset: 0xaef2): num
 <4><73>: Abbrev Number: 6 (DW_TAG_namespace)
    <74>   DW_AT_name        : (indirect string, offset: 0x9cf4): {{impl}}
 <5><78>: Abbrev Number: 9 (DW_TAG_subprogram)
    <79>   DW_AT_linkage_name: (indirect string, offset: 0x25f): _ZN4core7convert3num65_$LT$impl$u20$core..convert..From$LT$u8$GT$$u20$for$u20$usize$GT$4from17hd5a40ae55aedff5aE
    <7d>   DW_AT_name        : (indirect string, offset: 0x5f80): from
    <81>   DW_AT_decl_file   : 23
    <82>   DW_AT_decl_line   : 51
    <83>   DW_AT_type        : <0x67a0>
    <87>   DW_AT_inline      : 1	(inlined)
 <6><88>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <89>   DW_AT_name        : (indirect string, offset: 0xf684): small
    <8d>   DW_AT_decl_file   : 23
    <8e>   DW_AT_decl_line   : 51
    <8f>   DW_AT_type        : <0x58f2>
 <6><93>: Abbrev Number: 0
 <5><94>: Abbrev Number: 0
 <4><95>: Abbrev Number: 0
 <3><96>: Abbrev Number: 0
 <2><97>: Abbrev Number: 6 (DW_TAG_namespace)
    <98>   DW_AT_name        : (indirect string, offset: 0xc4a7): mem
 <3><9c>: Abbrev Number: 6 (DW_TAG_namespace)
    <9d>   DW_AT_name        : (indirect string, offset: 0x694a): maybe_uninit
 <4><a1>: Abbrev Number: 11 (DW_TAG_union_type)
    <a2>   DW_AT_name        : (indirect string, offset: 0xc4b1): MaybeUninit<stm32f4xx_hal::gpio::gpioa::PA5<stm32f4xx_hal::gpio::Output<stm32f4xx_hal::gpio::PushPull>>>
    <a6>   DW_AT_byte_size   : 0
    <a7>   DW_AT_alignment   : 1
 <5><a8>: Abbrev Number: 12 (DW_TAG_member)
    <a9>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <ad>   DW_AT_type        : <0x40>
    <b1>   DW_AT_alignment   : 1
    <b2>   DW_AT_data_member_location: 0
 <5><b3>: Abbrev Number: 12 (DW_TAG_member)
    <b4>   DW_AT_name        : (indirect string, offset: 0x730): value
    <b8>   DW_AT_type        : <0x22e>
    <bc>   DW_AT_alignment   : 1
    <bd>   DW_AT_data_member_location: 0
 <5><be>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <bf>   DW_AT_type        : <0x4a7d>
    <c3>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><c7>: Abbrev Number: 0
 <4><c8>: Abbrev Number: 11 (DW_TAG_union_type)
    <c9>   DW_AT_name        : (indirect string, offset: 0x786): MaybeUninit<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>>>
    <cd>   DW_AT_byte_size   : 1
    <ce>   DW_AT_alignment   : 1
 <5><cf>: Abbrev Number: 12 (DW_TAG_member)
    <d0>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <d4>   DW_AT_type        : <0x40>
    <d8>   DW_AT_alignment   : 1
    <d9>   DW_AT_data_member_location: 0
 <5><da>: Abbrev Number: 12 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x730): value
    <df>   DW_AT_type        : <0x24a>
    <e3>   DW_AT_alignment   : 1
    <e4>   DW_AT_data_member_location: 0
 <5><e5>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <e6>   DW_AT_type        : <0x58fe>
    <ea>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><ee>: Abbrev Number: 0
 <4><ef>: Abbrev Number: 11 (DW_TAG_union_type)
    <f0>   DW_AT_name        : (indirect string, offset: 0x3f5f): MaybeUninit<rtic::cyccnt::Instant>
    <f4>   DW_AT_byte_size   : 4
    <f5>   DW_AT_alignment   : 4
 <5><f6>: Abbrev Number: 12 (DW_TAG_member)
    <f7>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <fb>   DW_AT_type        : <0x40>
    <ff>   DW_AT_alignment   : 1
    <100>   DW_AT_data_member_location: 0
 <5><101>: Abbrev Number: 12 (DW_TAG_member)
    <102>   DW_AT_name        : (indirect string, offset: 0x730): value
    <106>   DW_AT_type        : <0x266>
    <10a>   DW_AT_alignment   : 4
    <10b>   DW_AT_data_member_location: 0
 <5><10c>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <10d>   DW_AT_type        : <0x5b33>
    <111>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><115>: Abbrev Number: 0
 <4><116>: Abbrev Number: 11 (DW_TAG_union_type)
    <117>   DW_AT_name        : (indirect string, offset: 0xe9d2): MaybeUninit<()>
    <11b>   DW_AT_byte_size   : 0
    <11c>   DW_AT_alignment   : 1
 <5><11d>: Abbrev Number: 12 (DW_TAG_member)
    <11e>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <122>   DW_AT_type        : <0x40>
    <126>   DW_AT_alignment   : 1
    <127>   DW_AT_data_member_location: 0
 <5><128>: Abbrev Number: 12 (DW_TAG_member)
    <129>   DW_AT_name        : (indirect string, offset: 0x730): value
    <12d>   DW_AT_type        : <0x282>
    <131>   DW_AT_alignment   : 1
    <132>   DW_AT_data_member_location: 0
 <5><133>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <134>   DW_AT_type        : <0x40>
    <138>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><13c>: Abbrev Number: 0
 <4><13d>: Abbrev Number: 11 (DW_TAG_union_type)
    <13e>   DW_AT_name        : (indirect string, offset: 0xea2b): MaybeUninit<generic_array::GenericArray<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8), typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>>>
    <142>   DW_AT_byte_size   : 4
    <143>   DW_AT_alignment   : 1
 <5><144>: Abbrev Number: 12 (DW_TAG_member)
    <145>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <149>   DW_AT_type        : <0x40>
    <14d>   DW_AT_alignment   : 1
    <14e>   DW_AT_data_member_location: 0
 <5><14f>: Abbrev Number: 12 (DW_TAG_member)
    <150>   DW_AT_name        : (indirect string, offset: 0x730): value
    <154>   DW_AT_type        : <0x29e>
    <158>   DW_AT_alignment   : 1
    <159>   DW_AT_data_member_location: 0
 <5><15a>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <15b>   DW_AT_type        : <0x595e>
    <15f>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><163>: Abbrev Number: 0
 <4><164>: Abbrev Number: 11 (DW_TAG_union_type)
    <165>   DW_AT_name        : (indirect string, offset: 0xfb15): MaybeUninit<generic_array::GenericArray<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>>>
    <169>   DW_AT_byte_size   : 16
    <16a>   DW_AT_alignment   : 4
 <5><16b>: Abbrev Number: 12 (DW_TAG_member)
    <16c>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <170>   DW_AT_type        : <0x40>
    <174>   DW_AT_alignment   : 1
    <175>   DW_AT_data_member_location: 0
 <5><176>: Abbrev Number: 12 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x730): value
    <17b>   DW_AT_type        : <0x2ba>
    <17f>   DW_AT_alignment   : 4
    <180>   DW_AT_data_member_location: 0
 <5><181>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <182>   DW_AT_type        : <0x59f9>
    <186>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><18a>: Abbrev Number: 0
 <4><18b>: Abbrev Number: 11 (DW_TAG_union_type)
    <18c>   DW_AT_name        : (indirect string, offset: 0x38b5): MaybeUninit<nucleo_rtic_blinking_led::init::RttControlBlock>
    <190>   DW_AT_byte_size   : 48
    <191>   DW_AT_alignment   : 4
 <5><192>: Abbrev Number: 12 (DW_TAG_member)
    <193>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <197>   DW_AT_type        : <0x40>
    <19b>   DW_AT_alignment   : 1
    <19c>   DW_AT_data_member_location: 0
 <5><19d>: Abbrev Number: 12 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0x730): value
    <1a2>   DW_AT_type        : <0x2d6>
    <1a6>   DW_AT_alignment   : 4
    <1a7>   DW_AT_data_member_location: 0
 <5><1a8>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <1a9>   DW_AT_type        : <0x46c3>
    <1ad>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><1b1>: Abbrev Number: 0
 <4><1b2>: Abbrev Number: 14 (DW_TAG_union_type)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x19): MaybeUninit<[u8; 1024]>
    <1b7>   DW_AT_byte_size   : 1024
    <1b9>   DW_AT_alignment   : 1
 <5><1ba>: Abbrev Number: 12 (DW_TAG_member)
    <1bb>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <1bf>   DW_AT_type        : <0x40>
    <1c3>   DW_AT_alignment   : 1
    <1c4>   DW_AT_data_member_location: 0
 <5><1c5>: Abbrev Number: 12 (DW_TAG_member)
    <1c6>   DW_AT_name        : (indirect string, offset: 0x730): value
    <1ca>   DW_AT_type        : <0x2f2>
    <1ce>   DW_AT_alignment   : 1
    <1cf>   DW_AT_data_member_location: 0
 <5><1d0>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <1d1>   DW_AT_type        : <0x6898>
    <1d5>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><1d9>: Abbrev Number: 0
 <4><1da>: Abbrev Number: 11 (DW_TAG_union_type)
    <1db>   DW_AT_name        : (indirect string, offset: 0x9f0a): MaybeUninit<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <1df>   DW_AT_byte_size   : 8
    <1e0>   DW_AT_alignment   : 4
 <5><1e1>: Abbrev Number: 12 (DW_TAG_member)
    <1e2>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <1e6>   DW_AT_type        : <0x40>
    <1ea>   DW_AT_alignment   : 1
    <1eb>   DW_AT_data_member_location: 0
 <5><1ec>: Abbrev Number: 12 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x730): value
    <1f1>   DW_AT_type        : <0x30f>
    <1f5>   DW_AT_alignment   : 4
    <1f6>   DW_AT_data_member_location: 0
 <5><1f7>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <1f8>   DW_AT_type        : <0x6299>
    <1fc>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><200>: Abbrev Number: 0
 <4><201>: Abbrev Number: 11 (DW_TAG_union_type)
    <202>   DW_AT_name        : (indirect string, offset: 0x2b31): MaybeUninit<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <206>   DW_AT_byte_size   : 2
    <207>   DW_AT_alignment   : 1
 <5><208>: Abbrev Number: 12 (DW_TAG_member)
    <209>   DW_AT_name        : (indirect string, offset: 0x5d7f): uninit
    <20d>   DW_AT_type        : <0x40>
    <211>   DW_AT_alignment   : 1
    <212>   DW_AT_data_member_location: 0
 <5><213>: Abbrev Number: 12 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0x730): value
    <218>   DW_AT_type        : <0x32b>
    <21c>   DW_AT_alignment   : 1
    <21d>   DW_AT_data_member_location: 0
 <5><21e>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <21f>   DW_AT_type        : <0x6782>
    <223>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><227>: Abbrev Number: 0
 <4><228>: Abbrev Number: 0
 <3><229>: Abbrev Number: 6 (DW_TAG_namespace)
    <22a>   DW_AT_name        : (indirect string, offset: 0x385b): manually_drop
 <4><22e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <22f>   DW_AT_name        : (indirect string, offset: 0xd732): ManuallyDrop<stm32f4xx_hal::gpio::gpioa::PA5<stm32f4xx_hal::gpio::Output<stm32f4xx_hal::gpio::PushPull>>>
    <233>   DW_AT_byte_size   : 0
    <234>   DW_AT_alignment   : 1
 <5><235>: Abbrev Number: 12 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x730): value
    <23a>   DW_AT_type        : <0x4a7d>
    <23e>   DW_AT_alignment   : 1
    <23f>   DW_AT_data_member_location: 0
 <5><240>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <241>   DW_AT_type        : <0x4a7d>
    <245>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><249>: Abbrev Number: 0
 <4><24a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <24b>   DW_AT_name        : (indirect string, offset: 0x512a): ManuallyDrop<generic_array::GenericArray<u8, typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>>>
    <24f>   DW_AT_byte_size   : 1
    <250>   DW_AT_alignment   : 1
 <5><251>: Abbrev Number: 12 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x730): value
    <256>   DW_AT_type        : <0x58fe>
    <25a>   DW_AT_alignment   : 1
    <25b>   DW_AT_data_member_location: 0
 <5><25c>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <25d>   DW_AT_type        : <0x58fe>
    <261>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><265>: Abbrev Number: 0
 <4><266>: Abbrev Number: 7 (DW_TAG_structure_type)
    <267>   DW_AT_name        : (indirect string, offset: 0xee2): ManuallyDrop<rtic::cyccnt::Instant>
    <26b>   DW_AT_byte_size   : 4
    <26c>   DW_AT_alignment   : 4
 <5><26d>: Abbrev Number: 12 (DW_TAG_member)
    <26e>   DW_AT_name        : (indirect string, offset: 0x730): value
    <272>   DW_AT_type        : <0x5b33>
    <276>   DW_AT_alignment   : 4
    <277>   DW_AT_data_member_location: 0
 <5><278>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <279>   DW_AT_type        : <0x5b33>
    <27d>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><281>: Abbrev Number: 0
 <4><282>: Abbrev Number: 7 (DW_TAG_structure_type)
    <283>   DW_AT_name        : (indirect string, offset: 0x8914): ManuallyDrop<()>
    <287>   DW_AT_byte_size   : 0
    <288>   DW_AT_alignment   : 1
 <5><289>: Abbrev Number: 12 (DW_TAG_member)
    <28a>   DW_AT_name        : (indirect string, offset: 0x730): value
    <28e>   DW_AT_type        : <0x40>
    <292>   DW_AT_alignment   : 1
    <293>   DW_AT_data_member_location: 0
 <5><294>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <295>   DW_AT_type        : <0x40>
    <299>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><29d>: Abbrev Number: 0
 <4><29e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <29f>   DW_AT_name        : (indirect string, offset: 0xac83): ManuallyDrop<generic_array::GenericArray<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8), typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>>>
    <2a3>   DW_AT_byte_size   : 4
    <2a4>   DW_AT_alignment   : 1
 <5><2a5>: Abbrev Number: 12 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x730): value
    <2aa>   DW_AT_type        : <0x595e>
    <2ae>   DW_AT_alignment   : 1
    <2af>   DW_AT_data_member_location: 0
 <5><2b0>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <2b1>   DW_AT_type        : <0x595e>
    <2b5>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><2b9>: Abbrev Number: 0
 <4><2ba>: Abbrev Number: 7 (DW_TAG_structure_type)
    <2bb>   DW_AT_name        : (indirect string, offset: 0x7b45): ManuallyDrop<generic_array::GenericArray<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>, typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>>>
    <2bf>   DW_AT_byte_size   : 16
    <2c0>   DW_AT_alignment   : 4
 <5><2c1>: Abbrev Number: 12 (DW_TAG_member)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x730): value
    <2c6>   DW_AT_type        : <0x59f9>
    <2ca>   DW_AT_alignment   : 4
    <2cb>   DW_AT_data_member_location: 0
 <5><2cc>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <2cd>   DW_AT_type        : <0x59f9>
    <2d1>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><2d5>: Abbrev Number: 0
 <4><2d6>: Abbrev Number: 7 (DW_TAG_structure_type)
    <2d7>   DW_AT_name        : (indirect string, offset: 0x63a2): ManuallyDrop<nucleo_rtic_blinking_led::init::RttControlBlock>
    <2db>   DW_AT_byte_size   : 48
    <2dc>   DW_AT_alignment   : 4
 <5><2dd>: Abbrev Number: 12 (DW_TAG_member)
    <2de>   DW_AT_name        : (indirect string, offset: 0x730): value
    <2e2>   DW_AT_type        : <0x46c3>
    <2e6>   DW_AT_alignment   : 4
    <2e7>   DW_AT_data_member_location: 0
 <5><2e8>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <2e9>   DW_AT_type        : <0x46c3>
    <2ed>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><2f1>: Abbrev Number: 0
 <4><2f2>: Abbrev Number: 15 (DW_TAG_structure_type)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x0): ManuallyDrop<[u8; 1024]>
    <2f7>   DW_AT_byte_size   : 1024
    <2f9>   DW_AT_alignment   : 1
 <5><2fa>: Abbrev Number: 12 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x730): value
    <2ff>   DW_AT_type        : <0x6898>
    <303>   DW_AT_alignment   : 1
    <304>   DW_AT_data_member_location: 0
 <5><305>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <306>   DW_AT_type        : <0x6898>
    <30a>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><30e>: Abbrev Number: 0
 <4><30f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <310>   DW_AT_name        : (indirect string, offset: 0x3a0a): ManuallyDrop<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <314>   DW_AT_byte_size   : 8
    <315>   DW_AT_alignment   : 4
 <5><316>: Abbrev Number: 12 (DW_TAG_member)
    <317>   DW_AT_name        : (indirect string, offset: 0x730): value
    <31b>   DW_AT_type        : <0x6299>
    <31f>   DW_AT_alignment   : 4
    <320>   DW_AT_data_member_location: 0
 <5><321>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <322>   DW_AT_type        : <0x6299>
    <326>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><32a>: Abbrev Number: 0
 <4><32b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <32c>   DW_AT_name        : (indirect string, offset: 0x8562): ManuallyDrop<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <330>   DW_AT_byte_size   : 2
    <331>   DW_AT_alignment   : 1
 <5><332>: Abbrev Number: 12 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x730): value
    <337>   DW_AT_type        : <0x6782>
    <33b>   DW_AT_alignment   : 1
    <33c>   DW_AT_data_member_location: 0
 <5><33d>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <33e>   DW_AT_type        : <0x6782>
    <342>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><346>: Abbrev Number: 0
 <4><347>: Abbrev Number: 0
 <3><348>: Abbrev Number: 16 (DW_TAG_subprogram)
    <349>   DW_AT_linkage_name: (indirect string, offset: 0x2cd0): _ZN4core3mem4swap17h1776949e03bce953E
    <34d>   DW_AT_name        : (indirect string, offset: 0xf78c): swap<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <351>   DW_AT_decl_file   : 33
    <352>   DW_AT_decl_line   : 696
    <354>   DW_AT_inline      : 1	(inlined)
 <4><355>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <356>   DW_AT_type        : <0x6299>
    <35a>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><35e>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <35f>   DW_AT_name        : (indirect string, offset: 0xbf5e): x
    <363>   DW_AT_decl_file   : 33
    <364>   DW_AT_decl_line   : 696
    <366>   DW_AT_type        : <0x7c8a>
 <4><36a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <36b>   DW_AT_name        : (indirect string, offset: 0x2b2f): y
    <36f>   DW_AT_decl_file   : 33
    <370>   DW_AT_decl_line   : 696
    <372>   DW_AT_type        : <0x7c8a>
 <4><376>: Abbrev Number: 0
 <3><377>: Abbrev Number: 0
 <2><378>: Abbrev Number: 6 (DW_TAG_namespace)
    <379>   DW_AT_name        : (indirect string, offset: 0x6957): marker
 <3><37d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <37e>   DW_AT_name        : (indirect string, offset: 0x92cf): PhantomData<stm32f4xx_hal::gpio::Output<stm32f4xx_hal::gpio::PushPull>>
    <382>   DW_AT_byte_size   : 0
    <383>   DW_AT_alignment   : 1
 <4><384>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <385>   DW_AT_type        : <0x4e95>
    <389>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><38d>: Abbrev Number: 0
 <3><38e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <38f>   DW_AT_name        : (indirect string, offset: 0x695e): PhantomData<stm32f4xx_hal::gpio::PushPull>
    <393>   DW_AT_byte_size   : 0
    <394>   DW_AT_alignment   : 1
 <4><395>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <396>   DW_AT_type        : <0x4eb1>
    <39a>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><39e>: Abbrev Number: 0
 <3><39f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3a0>   DW_AT_name        : (indirect string, offset: 0x7b19): PhantomData<heapless::spsc::SingleCore>
    <3a4>   DW_AT_byte_size   : 0
    <3a5>   DW_AT_alignment   : 1
 <4><3a6>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3a7>   DW_AT_type        : <0x50bb>
    <3ab>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><3af>: Abbrev Number: 0
 <3><3b0>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3b1>   DW_AT_name        : (indirect string, offset: 0xa460): PhantomData<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <3b5>   DW_AT_byte_size   : 0
    <3b6>   DW_AT_alignment   : 1
 <4><3b7>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3b8>   DW_AT_type        : <0x6782>
    <3bc>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><3c0>: Abbrev Number: 0
 <3><3c1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x8272): PhantomData<heapless::binary_heap::Min>
    <3c6>   DW_AT_byte_size   : 0
    <3c7>   DW_AT_alignment   : 1
 <4><3c8>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3c9>   DW_AT_type        : <0x5782>
    <3cd>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><3d1>: Abbrev Number: 0
 <3><3d2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x9c7c): PhantomData<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <3d7>   DW_AT_byte_size   : 0
    <3d8>   DW_AT_alignment   : 1
 <4><3d9>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3da>   DW_AT_type        : <0x6299>
    <3de>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><3e2>: Abbrev Number: 0
 <3><3e3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x4247): PhantomData<*const ()>
    <3e8>   DW_AT_byte_size   : 0
    <3e9>   DW_AT_alignment   : 1
 <4><3ea>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3eb>   DW_AT_type        : <0x7bfd>
    <3ef>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><3f3>: Abbrev Number: 0
 <3><3f4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x3381): PhantomData<&()>
    <3f9>   DW_AT_byte_size   : 0
    <3fa>   DW_AT_alignment   : 1
 <4><3fb>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <3fc>   DW_AT_type        : <0x7d07>
    <400>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><404>: Abbrev Number: 0
 <3><405>: Abbrev Number: 7 (DW_TAG_structure_type)
    <406>   DW_AT_name        : (indirect string, offset: 0xb01f): PhantomData<stm32f4::stm32f401::gpioa::_BSRR>
    <40a>   DW_AT_byte_size   : 0
    <40b>   DW_AT_alignment   : 1
 <4><40c>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <40d>   DW_AT_type        : <0x6a12>
    <411>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><415>: Abbrev Number: 0
 <3><416>: Abbrev Number: 7 (DW_TAG_structure_type)
    <417>   DW_AT_name        : (indirect string, offset: 0x7e60): PhantomData<*mut ()>
    <41b>   DW_AT_byte_size   : 0
    <41c>   DW_AT_alignment   : 1
 <4><41d>: Abbrev Number: 18 (DW_TAG_template_type_param)
    <41e>   DW_AT_type        : <0xa678>
    <422>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><426>: Abbrev Number: 0
 <3><427>: Abbrev Number: 7 (DW_TAG_structure_type)
    <428>   DW_AT_name        : (indirect string, offset: 0x7e9a): PhantomData<stm32f4xx_hal::gpio::Input<stm32f4xx_hal::gpio::Floating>>
    <42c>   DW_AT_byte_size   : 0
    <42d>   DW_AT_alignment   : 1
 <4><42e>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <42f>   DW_AT_type        : <0x4eb8>
    <433>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><437>: Abbrev Number: 0
 <3><438>: Abbrev Number: 7 (DW_TAG_structure_type)
    <439>   DW_AT_name        : (indirect string, offset: 0xbd8): PhantomData<stm32f4xx_hal::gpio::Floating>
    <43d>   DW_AT_byte_size   : 0
    <43e>   DW_AT_alignment   : 1
 <4><43f>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <440>   DW_AT_type        : <0x4ed4>
    <444>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><448>: Abbrev Number: 0
 <3><449>: Abbrev Number: 7 (DW_TAG_structure_type)
    <44a>   DW_AT_name        : (indirect string, offset: 0x8050): PhantomData<stm32f4::stm32f401::gpioa::_PUPDR>
    <44e>   DW_AT_byte_size   : 0
    <44f>   DW_AT_alignment   : 1
 <4><450>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <451>   DW_AT_type        : <0x6a19>
    <455>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><459>: Abbrev Number: 0
 <3><45a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <45b>   DW_AT_name        : (indirect string, offset: 0x5af): PhantomData<stm32f4::generic::Reg<u32, stm32f4::stm32f401::gpioa::_PUPDR>>
    <45f>   DW_AT_byte_size   : 0
    <460>   DW_AT_alignment   : 1
 <4><461>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <462>   DW_AT_type        : <0x70f0>
    <466>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><46a>: Abbrev Number: 0
 <3><46b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <46c>   DW_AT_name        : (indirect string, offset: 0xa195): PhantomData<stm32f4::stm32f401::gpioa::_OTYPER>
    <470>   DW_AT_byte_size   : 0
    <471>   DW_AT_alignment   : 1
 <4><472>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <473>   DW_AT_type        : <0x6a20>
    <477>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><47b>: Abbrev Number: 0
 <3><47c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <47d>   DW_AT_name        : (indirect string, offset: 0x1d03): PhantomData<stm32f4::generic::Reg<u32, stm32f4::stm32f401::gpioa::_OTYPER>>
    <481>   DW_AT_byte_size   : 0
    <482>   DW_AT_alignment   : 1
 <4><483>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <484>   DW_AT_type        : <0x71cb>
    <488>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><48c>: Abbrev Number: 0
 <3><48d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <48e>   DW_AT_name        : (indirect string, offset: 0x5fa): PhantomData<stm32f4::stm32f401::gpioa::_MODER>
    <492>   DW_AT_byte_size   : 0
    <493>   DW_AT_alignment   : 1
 <4><494>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <495>   DW_AT_type        : <0x6a27>
    <499>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><49d>: Abbrev Number: 0
 <3><49e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <49f>   DW_AT_name        : (indirect string, offset: 0x461c): PhantomData<stm32f4::generic::Reg<u32, stm32f4::stm32f401::gpioa::_MODER>>
    <4a3>   DW_AT_byte_size   : 0
    <4a4>   DW_AT_alignment   : 1
 <4><4a5>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <4a6>   DW_AT_type        : <0x72a6>
    <4aa>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><4ae>: Abbrev Number: 0
 <3><4af>: Abbrev Number: 0
 <2><4b0>: Abbrev Number: 6 (DW_TAG_namespace)
    <4b1>   DW_AT_name        : (indirect string, offset: 0x5d86): cell
 <3><4b5>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4b6>   DW_AT_name        : (indirect string, offset: 0x5d8b): UnsafeCell<u8>
    <4ba>   DW_AT_byte_size   : 1
    <4bb>   DW_AT_alignment   : 1
 <4><4bc>: Abbrev Number: 12 (DW_TAG_member)
    <4bd>   DW_AT_name        : (indirect string, offset: 0x730): value
    <4c1>   DW_AT_type        : <0x58f2>
    <4c5>   DW_AT_alignment   : 1
    <4c6>   DW_AT_data_member_location: 0
 <4><4c7>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <4c8>   DW_AT_type        : <0x58f2>
    <4cc>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><4d0>: Abbrev Number: 0
 <3><4d1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4d2>   DW_AT_name        : (indirect string, offset: 0xeb05): UnsafeCell<usize>
    <4d6>   DW_AT_byte_size   : 4
    <4d7>   DW_AT_alignment   : 4
 <4><4d8>: Abbrev Number: 12 (DW_TAG_member)
    <4d9>   DW_AT_name        : (indirect string, offset: 0x730): value
    <4dd>   DW_AT_type        : <0x67a0>
    <4e1>   DW_AT_alignment   : 4
    <4e2>   DW_AT_data_member_location: 0
 <4><4e3>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <4e4>   DW_AT_type        : <0x67a0>
    <4e8>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><4ec>: Abbrev Number: 0
 <3><4ed>: Abbrev Number: 7 (DW_TAG_structure_type)
    <4ee>   DW_AT_name        : (indirect string, offset: 0xaef6): UnsafeCell<u32>
    <4f2>   DW_AT_byte_size   : 4
    <4f3>   DW_AT_alignment   : 4
 <4><4f4>: Abbrev Number: 12 (DW_TAG_member)
    <4f5>   DW_AT_name        : (indirect string, offset: 0x730): value
    <4f9>   DW_AT_type        : <0x789f>
    <4fd>   DW_AT_alignment   : 4
    <4fe>   DW_AT_data_member_location: 0
 <4><4ff>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <500>   DW_AT_type        : <0x789f>
    <504>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><508>: Abbrev Number: 0
 <3><509>: Abbrev Number: 7 (DW_TAG_structure_type)
    <50a>   DW_AT_name        : (indirect string, offset: 0xaff2): Cell<u8>
    <50e>   DW_AT_byte_size   : 1
    <50f>   DW_AT_alignment   : 1
 <4><510>: Abbrev Number: 12 (DW_TAG_member)
    <511>   DW_AT_name        : (indirect string, offset: 0x730): value
    <515>   DW_AT_type        : <0x4b5>
    <519>   DW_AT_alignment   : 1
    <51a>   DW_AT_data_member_location: 0
 <4><51b>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <51c>   DW_AT_type        : <0x58f2>
    <520>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><524>: Abbrev Number: 0
 <3><525>: Abbrev Number: 0
 <2><526>: Abbrev Number: 6 (DW_TAG_namespace)
    <527>   DW_AT_name        : (indirect string, offset: 0xc530): sync
 <3><52b>: Abbrev Number: 6 (DW_TAG_namespace)
    <52c>   DW_AT_name        : (indirect string, offset: 0x7269): atomic
 <4><530>: Abbrev Number: 7 (DW_TAG_structure_type)
    <531>   DW_AT_name        : (indirect string, offset: 0xb492): AtomicUsize
    <535>   DW_AT_byte_size   : 4
    <536>   DW_AT_alignment   : 4
 <5><537>: Abbrev Number: 12 (DW_TAG_member)
    <538>   DW_AT_name        : (indirect string, offset: 0x2881): v
    <53c>   DW_AT_type        : <0x4d1>
    <540>   DW_AT_alignment   : 4
    <541>   DW_AT_data_member_location: 0
 <5><542>: Abbrev Number: 0
 <4><543>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <544>   DW_AT_type        : <0x58f2>
    <548>   DW_AT_enum_class  : 1
    <548>   DW_AT_name        : (indirect string, offset: 0x87e): Ordering
    <54c>   DW_AT_byte_size   : 1
    <54d>   DW_AT_alignment   : 1
 <5><54e>: Abbrev Number: 20 (DW_TAG_enumerator)
    <54f>   DW_AT_name        : (indirect string, offset: 0x8a20): Relaxed
    <553>   DW_AT_const_value : 0
 <5><554>: Abbrev Number: 20 (DW_TAG_enumerator)
    <555>   DW_AT_name        : (indirect string, offset: 0xcea9): Release
    <559>   DW_AT_const_value : 1
 <5><55a>: Abbrev Number: 20 (DW_TAG_enumerator)
    <55b>   DW_AT_name        : (indirect string, offset: 0x8a28): Acquire
    <55f>   DW_AT_const_value : 2
 <5><560>: Abbrev Number: 20 (DW_TAG_enumerator)
    <561>   DW_AT_name        : (indirect string, offset: 0x8a30): AcqRel
    <565>   DW_AT_const_value : 3
 <5><566>: Abbrev Number: 20 (DW_TAG_enumerator)
    <567>   DW_AT_name        : (indirect string, offset: 0xa49d): SeqCst
    <56b>   DW_AT_const_value : 4
 <5><56c>: Abbrev Number: 0
 <4><56d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <56e>   DW_AT_linkage_name: (indirect string, offset: 0xb8b2): _ZN4core4sync6atomic11atomic_load17hd92a492e014eae81E
    <572>   DW_AT_name        : (indirect string, offset: 0x5464): atomic_load<u8>
    <576>   DW_AT_decl_file   : 21
    <577>   DW_AT_decl_line   : 2348
    <579>   DW_AT_type        : <0x58f2>
    <57d>   DW_AT_inline      : 1	(inlined)
 <5><57e>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <57f>   DW_AT_type        : <0x58f2>
    <583>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><587>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <588>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <58c>   DW_AT_decl_file   : 21
    <58d>   DW_AT_decl_line   : 2348
    <58f>   DW_AT_type        : <0x6871>
 <5><593>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <594>   DW_AT_name        : (indirect string, offset: 0xe42a): order
    <598>   DW_AT_decl_file   : 21
    <599>   DW_AT_decl_line   : 2348
    <59b>   DW_AT_type        : <0x543>
 <5><59f>: Abbrev Number: 0
 <4><5a0>: Abbrev Number: 7 (DW_TAG_structure_type)
    <5a1>   DW_AT_name        : (indirect string, offset: 0x6644): AtomicU8
    <5a5>   DW_AT_byte_size   : 1
    <5a6>   DW_AT_alignment   : 1
 <5><5a7>: Abbrev Number: 12 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0x2881): v
    <5ac>   DW_AT_type        : <0x4b5>
    <5b0>   DW_AT_alignment   : 1
    <5b1>   DW_AT_data_member_location: 0
 <5><5b2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <5b3>   DW_AT_linkage_name: (indirect string, offset: 0x228): _ZN4core4sync6atomic8AtomicU84load17h0dac12883ddb81aaE
    <5b7>   DW_AT_name        : (indirect string, offset: 0xdabb): load
    <5bb>   DW_AT_decl_file   : 21
    <5bc>   DW_AT_decl_line   : 1489
    <5be>   DW_AT_type        : <0x58f2>
    <5c2>   DW_AT_inline      : 1	(inlined)
 <6><5c3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5c4>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <5c8>   DW_AT_decl_file   : 21
    <5c9>   DW_AT_decl_line   : 1489
    <5cb>   DW_AT_type        : <0x7d21>
 <6><5cf>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5d0>   DW_AT_name        : (indirect string, offset: 0xe42a): order
    <5d4>   DW_AT_decl_file   : 21
    <5d5>   DW_AT_decl_line   : 1489
    <5d7>   DW_AT_type        : <0x543>
 <6><5db>: Abbrev Number: 0
 <5><5dc>: Abbrev Number: 16 (DW_TAG_subprogram)
    <5dd>   DW_AT_linkage_name: (indirect string, offset: 0xdb53): _ZN4core4sync6atomic8AtomicU85store17h594850d74c907937E
    <5e1>   DW_AT_name        : (indirect string, offset: 0xa8a9): store
    <5e5>   DW_AT_decl_file   : 21
    <5e6>   DW_AT_decl_line   : 1515
    <5e8>   DW_AT_inline      : 1	(inlined)
 <6><5e9>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5ea>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <5ee>   DW_AT_decl_file   : 21
    <5ef>   DW_AT_decl_line   : 1515
    <5f1>   DW_AT_type        : <0x7d21>
 <6><5f5>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <5f6>   DW_AT_name        : (indirect string, offset: 0x2b25): val
    <5fa>   DW_AT_decl_file   : 21
    <5fb>   DW_AT_decl_line   : 1515
    <5fd>   DW_AT_type        : <0x58f2>
 <6><601>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <602>   DW_AT_name        : (indirect string, offset: 0xe42a): order
    <606>   DW_AT_decl_file   : 21
    <607>   DW_AT_decl_line   : 1515
    <609>   DW_AT_type        : <0x543>
 <6><60d>: Abbrev Number: 0
 <5><60e>: Abbrev Number: 0
 <4><60f>: Abbrev Number: 16 (DW_TAG_subprogram)
    <610>   DW_AT_linkage_name: (indirect string, offset: 0x49c2): _ZN4core4sync6atomic14compiler_fence17haae4f62d7de97854E
    <614>   DW_AT_name        : (indirect string, offset: 0xd105): compiler_fence
    <618>   DW_AT_decl_file   : 21
    <619>   DW_AT_decl_line   : 2743
    <61b>   DW_AT_inline      : 1	(inlined)
 <5><61c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <61d>   DW_AT_name        : (indirect string, offset: 0xe42a): order
    <621>   DW_AT_decl_file   : 21
    <622>   DW_AT_decl_line   : 2743
    <624>   DW_AT_type        : <0x543>
 <5><628>: Abbrev Number: 0
 <4><629>: Abbrev Number: 16 (DW_TAG_subprogram)
    <62a>   DW_AT_linkage_name: (indirect string, offset: 0xf6cf): _ZN4core4sync6atomic12atomic_store17h274d2de27fb80f51E
    <62e>   DW_AT_name        : (indirect string, offset: 0x5f85): atomic_store<u8>
    <632>   DW_AT_decl_file   : 21
    <633>   DW_AT_decl_line   : 2334
    <635>   DW_AT_inline      : 1	(inlined)
 <5><636>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <637>   DW_AT_type        : <0x58f2>
    <63b>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><63f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <640>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <644>   DW_AT_decl_file   : 21
    <645>   DW_AT_decl_line   : 2334
    <647>   DW_AT_type        : <0x687e>
 <5><64b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <64c>   DW_AT_name        : (indirect string, offset: 0x2b25): val
    <650>   DW_AT_decl_file   : 21
    <651>   DW_AT_decl_line   : 2334
    <653>   DW_AT_type        : <0x58f2>
 <5><657>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <658>   DW_AT_name        : (indirect string, offset: 0xe42a): order
    <65c>   DW_AT_decl_file   : 21
    <65d>   DW_AT_decl_line   : 2334
    <65f>   DW_AT_type        : <0x543>
 <5><663>: Abbrev Number: 0
 <4><664>: Abbrev Number: 0
 <3><665>: Abbrev Number: 0
 <2><666>: Abbrev Number: 6 (DW_TAG_namespace)
    <667>   DW_AT_name        : (indirect string, offset: 0xeb17): result
 <3><66b>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <66c>   DW_AT_type        : <0x58f2>
    <670>   DW_AT_enum_class  : 1
    <670>   DW_AT_name        : (indirect string, offset: 0x3f96): Result
    <674>   DW_AT_byte_size   : 1
    <675>   DW_AT_alignment   : 1
 <4><676>: Abbrev Number: 20 (DW_TAG_enumerator)
    <677>   DW_AT_name        : (indirect string, offset: 0xad47): Ok
    <67b>   DW_AT_const_value : 0
 <4><67c>: Abbrev Number: 20 (DW_TAG_enumerator)
    <67d>   DW_AT_name        : (indirect string, offset: 0x7270): Err
    <681>   DW_AT_const_value : 1
 <4><682>: Abbrev Number: 16 (DW_TAG_subprogram)
    <683>   DW_AT_linkage_name: (indirect string, offset: 0x81ee): _ZN4core6result19Result$LT$T$C$E$GT$6unwrap17h2b302d57ce39e270E
    <687>   DW_AT_name        : (indirect string, offset: 0x362a): unwrap<(),()>
    <68b>   DW_AT_decl_file   : 43
    <68c>   DW_AT_decl_line   : 1034
    <68e>   DW_AT_inline      : 1	(inlined)
 <5><68f>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <690>   DW_AT_type        : <0x40>
    <694>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><698>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <699>   DW_AT_type        : <0x40>
    <69d>   DW_AT_name        : (indirect string, offset: 0xf137): E
 <5><6a1>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <6a2>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <6a6>   DW_AT_decl_file   : 43
    <6a7>   DW_AT_decl_line   : 1034
    <6a9>   DW_AT_type        : <0x66b>
 <5><6ad>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <6><6ae>: Abbrev Number: 23 (DW_TAG_variable)
    <6af>   DW_AT_name        : (indirect string, offset: 0x88be): e
    <6b3>   DW_AT_decl_file   : 43
    <6b4>   DW_AT_decl_line   : 1037
    <6b6>   DW_AT_type        : <0x40>
 <6><6ba>: Abbrev Number: 0
 <5><6bb>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <6><6bc>: Abbrev Number: 23 (DW_TAG_variable)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x1d92): t
    <6c1>   DW_AT_decl_file   : 43
    <6c2>   DW_AT_decl_line   : 1036
    <6c4>   DW_AT_type        : <0x40>
 <6><6c8>: Abbrev Number: 0
 <5><6c9>: Abbrev Number: 0
 <4><6ca>: Abbrev Number: 0
 <3><6cb>: Abbrev Number: 0
 <2><6cc>: Abbrev Number: 6 (DW_TAG_namespace)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x1fc9): fmt
 <3><6d1>: Abbrev Number: 6 (DW_TAG_namespace)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x7274): rt
 <4><6d6>: Abbrev Number: 6 (DW_TAG_namespace)
    <6d7>   DW_AT_name        : (indirect string, offset: 0xbdb7): v1
 <5><6db>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <6dc>   DW_AT_type        : <0x58f2>
    <6e0>   DW_AT_enum_class  : 1
    <6e0>   DW_AT_name        : (indirect string, offset: 0x7cf8): Alignment
    <6e4>   DW_AT_byte_size   : 1
    <6e5>   DW_AT_alignment   : 1
 <6><6e6>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6e7>   DW_AT_name        : (indirect string, offset: 0x5231): Left
    <6eb>   DW_AT_const_value : 0
 <6><6ec>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xb49e): Right
    <6f1>   DW_AT_const_value : 1
 <6><6f2>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6f3>   DW_AT_name        : (indirect string, offset: 0xd880): Center
    <6f7>   DW_AT_const_value : 2
 <6><6f8>: Abbrev Number: 20 (DW_TAG_enumerator)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x47b6): Unknown
    <6fd>   DW_AT_const_value : 3
 <6><6fe>: Abbrev Number: 0
 <5><6ff>: Abbrev Number: 0
 <4><700>: Abbrev Number: 0
 <3><701>: Abbrev Number: 6 (DW_TAG_namespace)
    <702>   DW_AT_name        : (indirect string, offset: 0x9cf4): {{impl}}
 <4><706>: Abbrev Number: 24 (DW_TAG_subprogram)
    <707>   DW_AT_low_pc      : 0x800022e
    <70b>   DW_AT_high_pc     : 0x10
    <70f>   DW_AT_frame_base  : 1 byte block: 57 	(DW_OP_reg7 (r7))
    <711>   DW_AT_linkage_name: (indirect string, offset: 0x27d3): _ZN45_$LT$$LP$$RP$$u20$as$u20$core..fmt..Debug$GT$3fmt17h221c23de31c72cb5E
    <715>   DW_AT_name        : (indirect string, offset: 0x1fc9): fmt
    <719>   DW_AT_decl_file   : 3
    <71a>   DW_AT_decl_line   : 2210
    <71c>   DW_AT_type        : <0x66b>
 <5><720>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <721>   DW_AT_location    : 0x0 (location list)
    <725>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <729>   DW_AT_decl_file   : 3
    <72a>   DW_AT_decl_line   : 2210
    <72c>   DW_AT_type        : <0x7d07>
 <5><730>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <731>   DW_AT_location    : 0x29 (location list)
    <735>   DW_AT_name        : (indirect string, offset: 0x2164): f
    <739>   DW_AT_decl_file   : 3
    <73a>   DW_AT_decl_line   : 2210
    <73c>   DW_AT_type        : <0x7fe4>
 <5><740>: Abbrev Number: 0
 <4><741>: Abbrev Number: 0
 <3><742>: Abbrev Number: 7 (DW_TAG_structure_type)
    <743>   DW_AT_name        : (indirect string, offset: 0x6234): Formatter
    <747>   DW_AT_byte_size   : 36
    <748>   DW_AT_alignment   : 4
 <4><749>: Abbrev Number: 12 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x1fc3): flags
    <74e>   DW_AT_type        : <0x789f>
    <752>   DW_AT_alignment   : 4
    <753>   DW_AT_data_member_location: 0
 <4><754>: Abbrev Number: 12 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0xfa20): fill
    <759>   DW_AT_type        : <0x7ff1>
    <75d>   DW_AT_alignment   : 4
    <75e>   DW_AT_data_member_location: 4
 <4><75f>: Abbrev Number: 12 (DW_TAG_member)
    <760>   DW_AT_name        : (indirect string, offset: 0x68d6): align
    <764>   DW_AT_type        : <0x6db>
    <768>   DW_AT_alignment   : 1
    <769>   DW_AT_data_member_location: 32
 <4><76a>: Abbrev Number: 12 (DW_TAG_member)
    <76b>   DW_AT_name        : (indirect string, offset: 0xcdde): width
    <76f>   DW_AT_type        : <0xfb1>
    <773>   DW_AT_alignment   : 4
    <774>   DW_AT_data_member_location: 8
 <4><775>: Abbrev Number: 12 (DW_TAG_member)
    <776>   DW_AT_name        : (indirect string, offset: 0xc424): precision
    <77a>   DW_AT_type        : <0xfb1>
    <77e>   DW_AT_alignment   : 4
    <77f>   DW_AT_data_member_location: 16
 <4><780>: Abbrev Number: 12 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0x923a): buf
    <785>   DW_AT_type        : <0x78c>
    <789>   DW_AT_alignment   : 4
    <78a>   DW_AT_data_member_location: 24
 <4><78b>: Abbrev Number: 0
 <3><78c>: Abbrev Number: 7 (DW_TAG_structure_type)
    <78d>   DW_AT_name        : (indirect string, offset: 0x281e): &mut Write
    <791>   DW_AT_byte_size   : 8
    <792>   DW_AT_alignment   : 4
 <4><793>: Abbrev Number: 26 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0x6c98): pointer
    <798>   DW_AT_type        : <0x687e>
    <79c>   DW_AT_alignment   : 4
    <79d>   DW_AT_data_member_location: 0
    <79e>   DW_AT_artificial  : 1
 <4><79e>: Abbrev Number: 26 (DW_TAG_member)
    <79f>   DW_AT_name        : (indirect string, offset: 0x9c1e): vtable
    <7a3>   DW_AT_type        : <0x7ff8>
    <7a7>   DW_AT_alignment   : 4
    <7a8>   DW_AT_data_member_location: 4
    <7a9>   DW_AT_artificial  : 1
 <4><7a9>: Abbrev Number: 0
 <3><7aa>: Abbrev Number: 0
 <2><7ab>: Abbrev Number: 6 (DW_TAG_namespace)
    <7ac>   DW_AT_name        : (indirect string, offset: 0xf33e): cmp
 <3><7b0>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <7b1>   DW_AT_type        : <0x68a6>
    <7b5>   DW_AT_enum_class  : 1
    <7b5>   DW_AT_name        : (indirect string, offset: 0x87e): Ordering
    <7b9>   DW_AT_byte_size   : 1
    <7ba>   DW_AT_alignment   : 1
 <4><7bb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <7bc>   DW_AT_name        : (indirect string, offset: 0xb4a4): Less
    <7c0>   DW_AT_const_value : 4294967295
 <4><7c5>: Abbrev Number: 27 (DW_TAG_enumerator)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x878): Equal
    <7ca>   DW_AT_const_value : 0
 <4><7cb>: Abbrev Number: 27 (DW_TAG_enumerator)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x9cec): Greater
    <7d0>   DW_AT_const_value : 1
 <4><7d1>: Abbrev Number: 0
 <3><7d2>: Abbrev Number: 6 (DW_TAG_namespace)
    <7d3>   DW_AT_name        : (indirect string, offset: 0x1999): PartialOrd
 <4><7d7>: Abbrev Number: 28 (DW_TAG_subprogram)
    <7d8>   DW_AT_linkage_name: (indirect string, offset: 0x19a4): _ZN4core3cmp10PartialOrd2lt17hab5b9fa799fc428cE
    <7dc>   DW_AT_name        : (indirect string, offset: 0xed58): lt<rtic::cyccnt::Instant,rtic::cyccnt::Instant>
    <7e0>   DW_AT_decl_file   : 15
    <7e1>   DW_AT_decl_line   : 959
    <7e3>   DW_AT_type        : <0x81df>
    <7e7>   DW_AT_inline      : 1	(inlined)
 <5><7e8>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <7e9>   DW_AT_type        : <0x5b33>
    <7ed>   DW_AT_name        : (indirect string, offset: 0x849c): Self
 <5><7f1>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <7f2>   DW_AT_type        : <0x5b33>
    <7f6>   DW_AT_name        : (indirect string, offset: 0x74b5): Rhs
 <5><7fa>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <7fb>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <7ff>   DW_AT_decl_file   : 15
    <800>   DW_AT_decl_line   : 959
    <802>   DW_AT_type        : <0x7905>
 <5><806>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <807>   DW_AT_name        : (indirect string, offset: 0x322e): other
    <80b>   DW_AT_decl_file   : 15
    <80c>   DW_AT_decl_line   : 959
    <80e>   DW_AT_type        : <0x7905>
 <5><812>: Abbrev Number: 0
 <4><813>: Abbrev Number: 0
 <3><814>: Abbrev Number: 0
 <2><815>: Abbrev Number: 6 (DW_TAG_namespace)
    <816>   DW_AT_name        : (indirect string, offset: 0x9e36): ptr
 <3><81a>: Abbrev Number: 29 (DW_TAG_subprogram)
    <81b>   DW_AT_low_pc      : 0x800023e
    <81f>   DW_AT_high_pc     : 0x2
    <823>   DW_AT_frame_base  : 1 byte block: 57 	(DW_OP_reg7 (r7))
    <825>   DW_AT_linkage_name: (indirect string, offset: 0x46ef): _ZN4core3ptr29drop_in_place$LT$$LP$$RP$$GT$17h45cc3550ec245449E
    <829>   DW_AT_name        : (indirect string, offset: 0xf22e): drop_in_place<()>
    <82d>   DW_AT_decl_file   : 4
    <82e>   DW_AT_decl_line   : 179
 <4><82f>: Abbrev Number: 30 (DW_TAG_formal_parameter)
    <830>   DW_AT_location    : 1 byte block: 50 	(DW_OP_reg0 (r0))
    <832>   DW_AT_decl_file   : 4
    <833>   DW_AT_decl_line   : 179
    <834>   DW_AT_type        : <0xa678>
 <4><838>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <839>   DW_AT_type        : <0x40>
    <83d>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><841>: Abbrev Number: 0
 <3><842>: Abbrev Number: 21 (DW_TAG_subprogram)
    <843>   DW_AT_linkage_name: (indirect string, offset: 0x4217): _ZN4core3ptr13read_volatile17h7c4f9555851a1a9fE
    <847>   DW_AT_name        : (indirect string, offset: 0xed88): read_volatile<u32>
    <84b>   DW_AT_decl_file   : 4
    <84c>   DW_AT_decl_line   : 1056
    <84e>   DW_AT_type        : <0x789f>
    <852>   DW_AT_inline      : 1	(inlined)
 <4><853>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <854>   DW_AT_type        : <0x789f>
    <858>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><85c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <85d>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <861>   DW_AT_decl_file   : 4
    <862>   DW_AT_decl_line   : 1056
    <864>   DW_AT_type        : <0x7912>
 <4><868>: Abbrev Number: 0
 <3><869>: Abbrev Number: 16 (DW_TAG_subprogram)
    <86a>   DW_AT_linkage_name: (indirect string, offset: 0xc6f5): _ZN4core3ptr14write_volatile17h73138c49bca89b9dE
    <86e>   DW_AT_name        : (indirect string, offset: 0x95d5): write_volatile<u32>
    <872>   DW_AT_decl_file   : 4
    <873>   DW_AT_decl_line   : 1127
    <875>   DW_AT_inline      : 1	(inlined)
 <4><876>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <877>   DW_AT_type        : <0x789f>
    <87b>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><87f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <880>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <884>   DW_AT_decl_file   : 4
    <885>   DW_AT_decl_line   : 1127
    <887>   DW_AT_type        : <0x7c17>
 <4><88b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <88c>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <890>   DW_AT_decl_file   : 4
    <891>   DW_AT_decl_line   : 1127
    <893>   DW_AT_type        : <0x789f>
 <4><897>: Abbrev Number: 0
 <3><898>: Abbrev Number: 6 (DW_TAG_namespace)
    <899>   DW_AT_name        : (indirect string, offset: 0x6634): mut_ptr
 <4><89d>: Abbrev Number: 6 (DW_TAG_namespace)
    <89e>   DW_AT_name        : (indirect string, offset: 0x9cf4): {{impl}}
 <5><8a2>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8a3>   DW_AT_linkage_name: (indirect string, offset: 0xc72f): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h33db2b1add7dcaf4E
    <8a7>   DW_AT_name        : (indirect string, offset: 0x48e4): offset<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <8ab>   DW_AT_decl_file   : 12
    <8ac>   DW_AT_decl_line   : 225
    <8ad>   DW_AT_type        : <0x7c31>
    <8b1>   DW_AT_inline      : 1	(inlined)
 <6><8b2>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <8b3>   DW_AT_type        : <0x6299>
    <8b7>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><8bb>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <8bc>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <8c0>   DW_AT_decl_file   : 12
    <8c1>   DW_AT_decl_line   : 225
    <8c2>   DW_AT_type        : <0x7c31>
 <6><8c6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <8cb>   DW_AT_decl_file   : 12
    <8cc>   DW_AT_decl_line   : 225
    <8cd>   DW_AT_type        : <0x7c3e>
 <6><8d1>: Abbrev Number: 0
 <5><8d2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <8d3>   DW_AT_linkage_name: (indirect string, offset: 0x3333): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17h0f64409457042152E
    <8d7>   DW_AT_name        : (indirect string, offset: 0x4938): add<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <8db>   DW_AT_decl_file   : 12
    <8dc>   DW_AT_decl_line   : 605
    <8de>   DW_AT_type        : <0x7c31>
    <8e2>   DW_AT_inline      : 1	(inlined)
 <6><8e3>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <8e4>   DW_AT_type        : <0x6299>
    <8e8>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><8ec>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <8ed>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <8f1>   DW_AT_decl_file   : 12
    <8f2>   DW_AT_decl_line   : 605
    <8f4>   DW_AT_type        : <0x7c31>
 <6><8f8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <8f9>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <8fd>   DW_AT_decl_file   : 12
    <8fe>   DW_AT_decl_line   : 605
    <900>   DW_AT_type        : <0x67a0>
 <6><904>: Abbrev Number: 0
 <5><905>: Abbrev Number: 16 (DW_TAG_subprogram)
    <906>   DW_AT_linkage_name: (indirect string, offset: 0xa5d): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17hb0ac7668f0c9a058E
    <90a>   DW_AT_name        : (indirect string, offset: 0x6b9a): write<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <90e>   DW_AT_decl_file   : 12
    <90f>   DW_AT_decl_line   : 996
    <911>   DW_AT_inline      : 1	(inlined)
 <6><912>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <913>   DW_AT_type        : <0x6299>
    <917>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><91b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <91c>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <920>   DW_AT_decl_file   : 12
    <921>   DW_AT_decl_line   : 996
    <923>   DW_AT_type        : <0x7c31>
 <6><927>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <928>   DW_AT_name        : (indirect string, offset: 0x2b25): val
    <92c>   DW_AT_decl_file   : 12
    <92d>   DW_AT_decl_line   : 996
    <92f>   DW_AT_type        : <0x6299>
 <6><933>: Abbrev Number: 0
 <5><934>: Abbrev Number: 16 (DW_TAG_subprogram)
    <935>   DW_AT_linkage_name: (indirect string, offset: 0xdb8b): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17h8f5d58321636715fE
    <939>   DW_AT_name        : (indirect string, offset: 0x6ca4): write<u8>
    <93d>   DW_AT_decl_file   : 12
    <93e>   DW_AT_decl_line   : 996
    <940>   DW_AT_inline      : 1	(inlined)
 <6><941>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <942>   DW_AT_type        : <0x58f2>
    <946>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><94a>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <94b>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <94f>   DW_AT_decl_file   : 12
    <950>   DW_AT_decl_line   : 996
    <952>   DW_AT_type        : <0x687e>
 <6><956>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <957>   DW_AT_name        : (indirect string, offset: 0x2b25): val
    <95b>   DW_AT_decl_file   : 12
    <95c>   DW_AT_decl_line   : 996
    <95e>   DW_AT_type        : <0x58f2>
 <6><962>: Abbrev Number: 0
 <5><963>: Abbrev Number: 16 (DW_TAG_subprogram)
    <964>   DW_AT_linkage_name: (indirect string, offset: 0x5577): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$5write17h59cca3f6342a8b05E
    <968>   DW_AT_name        : (indirect string, offset: 0x305): write<rtic::cyccnt::Instant>
    <96c>   DW_AT_decl_file   : 12
    <96d>   DW_AT_decl_line   : 996
    <96f>   DW_AT_inline      : 1	(inlined)
 <6><970>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <971>   DW_AT_type        : <0x5b33>
    <975>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><979>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <97a>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <97e>   DW_AT_decl_file   : 12
    <97f>   DW_AT_decl_line   : 996
    <981>   DW_AT_type        : <0x7dca>
 <6><985>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <986>   DW_AT_name        : (indirect string, offset: 0x2b25): val
    <98a>   DW_AT_decl_file   : 12
    <98b>   DW_AT_decl_line   : 996
    <98d>   DW_AT_type        : <0x5b33>
 <6><991>: Abbrev Number: 0
 <5><992>: Abbrev Number: 9 (DW_TAG_subprogram)
    <993>   DW_AT_linkage_name: (indirect string, offset: 0xaac3): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$6offset17h48ad2c52738323d5E
    <997>   DW_AT_name        : (indirect string, offset: 0x788b): offset<core::mem::maybe_uninit::MaybeUninit<rtic::cyccnt::Instant>>
    <99b>   DW_AT_decl_file   : 12
    <99c>   DW_AT_decl_line   : 225
    <99d>   DW_AT_type        : <0x7f81>
    <9a1>   DW_AT_inline      : 1	(inlined)
 <6><9a2>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <9a3>   DW_AT_type        : <0xef>
    <9a7>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><9ab>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <9b0>   DW_AT_decl_file   : 12
    <9b1>   DW_AT_decl_line   : 225
    <9b2>   DW_AT_type        : <0x7f81>
 <6><9b6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <9b7>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <9bb>   DW_AT_decl_file   : 12
    <9bc>   DW_AT_decl_line   : 225
    <9bd>   DW_AT_type        : <0x7c3e>
 <6><9c1>: Abbrev Number: 0
 <5><9c2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <9c3>   DW_AT_linkage_name: (indirect string, offset: 0xd345): _ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$3add17hd294f149f7f1cc05E
    <9c7>   DW_AT_name        : (indirect string, offset: 0x4ebb): add<core::mem::maybe_uninit::MaybeUninit<rtic::cyccnt::Instant>>
    <9cb>   DW_AT_decl_file   : 12
    <9cc>   DW_AT_decl_line   : 605
    <9ce>   DW_AT_type        : <0x7f81>
    <9d2>   DW_AT_inline      : 1	(inlined)
 <6><9d3>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <9d4>   DW_AT_type        : <0xef>
    <9d8>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><9dc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <9dd>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <9e1>   DW_AT_decl_file   : 12
    <9e2>   DW_AT_decl_line   : 605
    <9e4>   DW_AT_type        : <0x7f81>
 <6><9e8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <9ed>   DW_AT_decl_file   : 12
    <9ee>   DW_AT_decl_line   : 605
    <9f0>   DW_AT_type        : <0x67a0>
 <6><9f4>: Abbrev Number: 0
 <5><9f5>: Abbrev Number: 0
 <4><9f6>: Abbrev Number: 0
 <3><9f7>: Abbrev Number: 16 (DW_TAG_subprogram)
    <9f8>   DW_AT_linkage_name: (indirect string, offset: 0x5f20): _ZN4core3ptr5write17h80c0b7450b6236c3E
    <9fc>   DW_AT_name        : (indirect string, offset: 0x6b9a): write<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <a00>   DW_AT_decl_file   : 4
    <a01>   DW_AT_decl_line   : 883
    <a03>   DW_AT_inline      : 1	(inlined)
 <4><a04>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <a05>   DW_AT_type        : <0x6299>
    <a09>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><a0d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a0e>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <a12>   DW_AT_decl_file   : 4
    <a13>   DW_AT_decl_line   : 883
    <a15>   DW_AT_type        : <0x7c31>
 <4><a19>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a1a>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <a1e>   DW_AT_decl_file   : 4
    <a1f>   DW_AT_decl_line   : 883
    <a21>   DW_AT_type        : <0x6299>
 <4><a25>: Abbrev Number: 0
 <3><a26>: Abbrev Number: 21 (DW_TAG_subprogram)
    <a27>   DW_AT_linkage_name: (indirect string, offset: 0x10aa): _ZN4core3ptr4read17h73b53987385fb845E
    <a2b>   DW_AT_name        : (indirect string, offset: 0xa6bc): read<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <a2f>   DW_AT_decl_file   : 4
    <a30>   DW_AT_decl_line   : 689
    <a32>   DW_AT_type        : <0x6299>
    <a36>   DW_AT_inline      : 1	(inlined)
 <4><a37>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <a38>   DW_AT_type        : <0x6299>
    <a3c>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><a40>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <a41>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <a45>   DW_AT_decl_file   : 4
    <a46>   DW_AT_decl_line   : 689
    <a48>   DW_AT_type        : <0x78c4>
 <4><a4c>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <5><a4d>: Abbrev Number: 23 (DW_TAG_variable)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xa70e): tmp
    <a52>   DW_AT_decl_file   : 4
    <a53>   DW_AT_decl_line   : 690
    <a55>   DW_AT_type        : <0x1da>
 <5><a59>: Abbrev Number: 0
 <4><a5a>: Abbrev Number: 0
 <3><a5b>: Abbrev Number: 31 (DW_TAG_subprogram)
    <a5c>   DW_AT_linkage_name: (indirect string, offset: 0x3af2): _ZN4core3ptr138drop_in_place$LT$heapless..binary_heap..Hole$LT$rtic..tq..NotReady$LT$rtic..cyccnt..CYCCNT$C$nucleo_rtic_blinking_led..APP..T0$GT$$GT$$GT$17h04863f34e8774446E
    <a60>   DW_AT_name        : (indirect string, offset: 0xd9e2): drop_in_place<heapless::binary_heap::Hole<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>>
    <a64>   DW_AT_decl_file   : 4
    <a65>   DW_AT_decl_line   : 179
    <a66>   DW_AT_inline      : 1	(inlined)
 <4><a67>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <a68>   DW_AT_type        : <0x578b>
    <a6c>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><a70>: Abbrev Number: 32 (DW_TAG_formal_parameter)
    <a71>   DW_AT_decl_file   : 4
    <a72>   DW_AT_decl_line   : 179
    <a73>   DW_AT_type        : <0x7c7d>
 <4><a77>: Abbrev Number: 0
 <3><a78>: Abbrev Number: 6 (DW_TAG_namespace)
    <a79>   DW_AT_name        : (indirect string, offset: 0xe419): const_ptr
 <4><a7d>: Abbrev Number: 6 (DW_TAG_namespace)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x9cf4): {{impl}}
 <5><a82>: Abbrev Number: 9 (DW_TAG_subprogram)
    <a83>   DW_AT_linkage_name: (indirect string, offset: 0xb850): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17hfada20119d99e26cE
    <a87>   DW_AT_name        : (indirect string, offset: 0x48e4): offset<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <a8b>   DW_AT_decl_file   : 14
    <a8c>   DW_AT_decl_line   : 220
    <a8d>   DW_AT_type        : <0x78c4>
    <a91>   DW_AT_inline      : 1	(inlined)
 <6><a92>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <a93>   DW_AT_type        : <0x6299>
    <a97>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><a9b>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <a9c>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <aa0>   DW_AT_decl_file   : 14
    <aa1>   DW_AT_decl_line   : 220
    <aa2>   DW_AT_type        : <0x78c4>
 <6><aa6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <aab>   DW_AT_decl_file   : 14
    <aac>   DW_AT_decl_line   : 220
    <aad>   DW_AT_type        : <0x7c3e>
 <6><ab1>: Abbrev Number: 0
 <5><ab2>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ab3>   DW_AT_linkage_name: (indirect string, offset: 0x8d5c): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h066a76feaf6a9bf4E
    <ab7>   DW_AT_name        : (indirect string, offset: 0x4938): add<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <abb>   DW_AT_decl_file   : 14
    <abc>   DW_AT_decl_line   : 498
    <abe>   DW_AT_type        : <0x78c4>
    <ac2>   DW_AT_inline      : 1	(inlined)
 <6><ac3>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <ac4>   DW_AT_type        : <0x6299>
    <ac8>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><acc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <acd>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <ad1>   DW_AT_decl_file   : 14
    <ad2>   DW_AT_decl_line   : 498
    <ad4>   DW_AT_type        : <0x78c4>
 <6><ad8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <ad9>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <add>   DW_AT_decl_file   : 14
    <ade>   DW_AT_decl_line   : 498
    <ae0>   DW_AT_type        : <0x67a0>
 <6><ae4>: Abbrev Number: 0
 <5><ae5>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ae6>   DW_AT_linkage_name: (indirect string, offset: 0xdac0): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$6offset17h93b736a7bab2c585E
    <aea>   DW_AT_name        : (indirect string, offset: 0x852a): offset<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <aee>   DW_AT_decl_file   : 14
    <aef>   DW_AT_decl_line   : 220
    <af0>   DW_AT_type        : <0x7d3b>
    <af4>   DW_AT_inline      : 1	(inlined)
 <6><af5>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <af6>   DW_AT_type        : <0x6782>
    <afa>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><afe>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <aff>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <b03>   DW_AT_decl_file   : 14
    <b04>   DW_AT_decl_line   : 220
    <b05>   DW_AT_type        : <0x7d3b>
 <6><b09>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <b0e>   DW_AT_decl_file   : 14
    <b0f>   DW_AT_decl_line   : 220
    <b10>   DW_AT_type        : <0x7c3e>
 <6><b14>: Abbrev Number: 0
 <5><b15>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b16>   DW_AT_linkage_name: (indirect string, offset: 0x1a1f): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h441f1f83a966423bE
    <b1a>   DW_AT_name        : (indirect string, offset: 0xc09c): add<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <b1e>   DW_AT_decl_file   : 14
    <b1f>   DW_AT_decl_line   : 498
    <b21>   DW_AT_type        : <0x7d3b>
    <b25>   DW_AT_inline      : 1	(inlined)
 <6><b26>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <b27>   DW_AT_type        : <0x6782>
    <b2b>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><b2f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <b30>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <b34>   DW_AT_decl_file   : 14
    <b35>   DW_AT_decl_line   : 498
    <b37>   DW_AT_type        : <0x7d3b>
 <6><b3b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x425e): count
    <b40>   DW_AT_decl_file   : 14
    <b41>   DW_AT_decl_line   : 498
    <b43>   DW_AT_type        : <0x67a0>
 <6><b47>: Abbrev Number: 0
 <5><b48>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b49>   DW_AT_linkage_name: (indirect string, offset: 0x9f63): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4read17h470feef2047092a7E
    <b4d>   DW_AT_name        : (indirect string, offset: 0xc0d1): read<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <b51>   DW_AT_decl_file   : 14
    <b52>   DW_AT_decl_line   : 750
    <b54>   DW_AT_type        : <0x6782>
    <b58>   DW_AT_inline      : 1	(inlined)
 <6><b59>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <b5a>   DW_AT_type        : <0x6782>
    <b5e>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><b62>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <b63>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <b67>   DW_AT_decl_file   : 14
    <b68>   DW_AT_decl_line   : 750
    <b6a>   DW_AT_type        : <0x7d3b>
 <6><b6e>: Abbrev Number: 0
 <5><b6f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b70>   DW_AT_linkage_name: (indirect string, offset: 0x8fa5): _ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4read17hfdbe4489c9fd0ac0E
    <b74>   DW_AT_name        : (indirect string, offset: 0xa6bc): read<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <b78>   DW_AT_decl_file   : 14
    <b79>   DW_AT_decl_line   : 750
    <b7b>   DW_AT_type        : <0x6299>
    <b7f>   DW_AT_inline      : 1	(inlined)
 <6><b80>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <b81>   DW_AT_type        : <0x6299>
    <b85>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <6><b89>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <b8a>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <b8e>   DW_AT_decl_file   : 14
    <b8f>   DW_AT_decl_line   : 750
    <b91>   DW_AT_type        : <0x78c4>
 <6><b95>: Abbrev Number: 0
 <5><b96>: Abbrev Number: 0
 <4><b97>: Abbrev Number: 0
 <3><b98>: Abbrev Number: 6 (DW_TAG_namespace)
    <b99>   DW_AT_name        : (indirect string, offset: 0x1141): non_null
 <4><b9d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <b9e>   DW_AT_name        : (indirect string, offset: 0xa772): NonNull<heapless::spsc::Queue<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8), typenum::uint::UInt<typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, typenum::bit::B0>, u8, heapless::spsc::SingleCore>>
    <ba2>   DW_AT_byte_size   : 4
    <ba3>   DW_AT_alignment   : 4
 <5><ba4>: Abbrev Number: 12 (DW_TAG_member)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x6c98): pointer
    <ba9>   DW_AT_type        : <0x7cfa>
    <bad>   DW_AT_alignment   : 4
    <bae>   DW_AT_data_member_location: 0
 <5><baf>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <bb0>   DW_AT_type        : <0x50c2>
    <bb4>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><bb8>: Abbrev Number: 0
 <4><bb9>: Abbrev Number: 7 (DW_TAG_structure_type)
    <bba>   DW_AT_name        : (indirect string, offset: 0x75c1): NonNull<heapless::spsc::Queue<u8, typenum::uint::UInt<typenum::uint::UTerm, typenum::bit::B1>, u8, heapless::spsc::SingleCore>>
    <bbe>   DW_AT_byte_size   : 4
    <bbf>   DW_AT_alignment   : 4
 <5><bc0>: Abbrev Number: 12 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x6c98): pointer
    <bc5>   DW_AT_type        : <0x7d55>
    <bc9>   DW_AT_alignment   : 4
    <bca>   DW_AT_data_member_location: 0
 <5><bcb>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <bcc>   DW_AT_type        : <0x4ee7>
    <bd0>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><bd4>: Abbrev Number: 0
 <4><bd5>: Abbrev Number: 0
 <3><bd6>: Abbrev Number: 21 (DW_TAG_subprogram)
    <bd7>   DW_AT_linkage_name: (indirect string, offset: 0xd114): _ZN4core3ptr4read17hf6fc8755745a6e6cE
    <bdb>   DW_AT_name        : (indirect string, offset: 0xc0d1): read<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <bdf>   DW_AT_decl_file   : 4
    <be0>   DW_AT_decl_line   : 689
    <be2>   DW_AT_type        : <0x6782>
    <be6>   DW_AT_inline      : 1	(inlined)
 <4><be7>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <be8>   DW_AT_type        : <0x6782>
    <bec>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><bf0>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <bf5>   DW_AT_decl_file   : 4
    <bf6>   DW_AT_decl_line   : 689
    <bf8>   DW_AT_type        : <0x7d3b>
 <4><bfc>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <5><bfd>: Abbrev Number: 23 (DW_TAG_variable)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xa70e): tmp
    <c02>   DW_AT_decl_file   : 4
    <c03>   DW_AT_decl_line   : 690
    <c05>   DW_AT_type        : <0x201>
 <5><c09>: Abbrev Number: 0
 <4><c0a>: Abbrev Number: 0
 <3><c0b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c0c>   DW_AT_linkage_name: (indirect string, offset: 0xa8af): _ZN4core3ptr5write17h4425fb53305ee6fdE
    <c10>   DW_AT_name        : (indirect string, offset: 0x6ca4): write<u8>
    <c14>   DW_AT_decl_file   : 4
    <c15>   DW_AT_decl_line   : 883
    <c17>   DW_AT_inline      : 1	(inlined)
 <4><c18>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <c19>   DW_AT_type        : <0x58f2>
    <c1d>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><c21>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c22>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <c26>   DW_AT_decl_file   : 4
    <c27>   DW_AT_decl_line   : 883
    <c29>   DW_AT_type        : <0x687e>
 <4><c2d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c2e>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <c32>   DW_AT_decl_file   : 4
    <c33>   DW_AT_decl_line   : 883
    <c35>   DW_AT_type        : <0x58f2>
 <4><c39>: Abbrev Number: 0
 <3><c3a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c3b>   DW_AT_linkage_name: (indirect string, offset: 0xf72f): _ZN4core3ptr5write17h64f8806dfcfc34feE
    <c3f>   DW_AT_name        : (indirect string, offset: 0x305): write<rtic::cyccnt::Instant>
    <c43>   DW_AT_decl_file   : 4
    <c44>   DW_AT_decl_line   : 883
    <c46>   DW_AT_inline      : 1	(inlined)
 <4><c47>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <c48>   DW_AT_type        : <0x5b33>
    <c4c>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><c50>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c51>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <c55>   DW_AT_decl_file   : 4
    <c56>   DW_AT_decl_line   : 883
    <c58>   DW_AT_type        : <0x7dca>
 <4><c5c>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <c61>   DW_AT_decl_file   : 4
    <c62>   DW_AT_decl_line   : 883
    <c64>   DW_AT_type        : <0x5b33>
 <4><c68>: Abbrev Number: 0
 <3><c69>: Abbrev Number: 16 (DW_TAG_subprogram)
    <c6a>   DW_AT_linkage_name: (indirect string, offset: 0x600d): _ZN4core3ptr23swap_nonoverlapping_one17hbfa8e1a0b70ea030E
    <c6e>   DW_AT_name        : (indirect string, offset: 0x4344): swap_nonoverlapping_one<rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <c72>   DW_AT_decl_file   : 4
    <c73>   DW_AT_decl_line   : 451
    <c75>   DW_AT_inline      : 1	(inlined)
 <4><c76>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <c77>   DW_AT_type        : <0x6299>
    <c7b>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><c7f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c80>   DW_AT_name        : (indirect string, offset: 0xbf5e): x
    <c84>   DW_AT_decl_file   : 4
    <c85>   DW_AT_decl_line   : 451
    <c87>   DW_AT_type        : <0x7c31>
 <4><c8b>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x2b2f): y
    <c90>   DW_AT_decl_file   : 4
    <c91>   DW_AT_decl_line   : 451
    <c93>   DW_AT_type        : <0x7c31>
 <4><c97>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <5><c98>: Abbrev Number: 23 (DW_TAG_variable)
    <c99>   DW_AT_name        : (indirect string, offset: 0xf78a): z
    <c9d>   DW_AT_decl_file   : 4
    <c9e>   DW_AT_decl_line   : 458
    <ca0>   DW_AT_type        : <0x6299>
 <5><ca4>: Abbrev Number: 0
 <4><ca5>: Abbrev Number: 0
 <3><ca6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ca7>   DW_AT_linkage_name: (indirect string, offset: 0xba67): _ZN4core3ptr14write_volatile17h26f4167e48f37c05E
    <cab>   DW_AT_name        : (indirect string, offset: 0x107a8): write_volatile<u8>
    <caf>   DW_AT_decl_file   : 4
    <cb0>   DW_AT_decl_line   : 1127
    <cb2>   DW_AT_inline      : 1	(inlined)
 <4><cb3>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <cb4>   DW_AT_type        : <0x58f2>
    <cb8>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <4><cbc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <cbd>   DW_AT_name        : (indirect string, offset: 0xeda5): dst
    <cc1>   DW_AT_decl_file   : 4
    <cc2>   DW_AT_decl_line   : 1127
    <cc4>   DW_AT_type        : <0x687e>
 <4><cc8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x53b1): src
    <ccd>   DW_AT_decl_file   : 4
    <cce>   DW_AT_decl_line   : 1127
    <cd0>   DW_AT_type        : <0x58f2>
 <4><cd4>: Abbrev Number: 0
 <3><cd5>: Abbrev Number: 0
 <2><cd6>: Abbrev Number: 6 (DW_TAG_namespace)
    <cd7>   DW_AT_name        : (indirect string, offset: 0xf3af): option
 <3><cdb>: Abbrev Number: 7 (DW_TAG_structure_type)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xbf09): Option<&rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>>
    <ce0>   DW_AT_byte_size   : 4
    <ce1>   DW_AT_alignment   : 4
 <4><ce2>: Abbrev Number: 33 (DW_TAG_variant_part)
    <ce3>   DW_AT_discr       : <0xce7>
 <5><ce7>: Abbrev Number: 34 (DW_TAG_member)
    <ce8>   DW_AT_type        : <0x789f>
    <cec>   DW_AT_alignment   : 4
    <ced>   DW_AT_data_member_location: 0
    <cee>   DW_AT_artificial  : 1
 <5><cee>: Abbrev Number: 35 (DW_TAG_variant)
    <cef>   DW_AT_discr_value : 0
 <6><cf0>: Abbrev Number: 12 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <cf5>   DW_AT_type        : <0xd0a>
    <cf9>   DW_AT_alignment   : 4
    <cfa>   DW_AT_data_member_location: 0
 <6><cfb>: Abbrev Number: 0
 <5><cfc>: Abbrev Number: 36 (DW_TAG_variant)
 <6><cfd>: Abbrev Number: 12 (DW_TAG_member)
    <cfe>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <d02>   DW_AT_type        : <0xd1b>
    <d06>   DW_AT_alignment   : 4
    <d07>   DW_AT_data_member_location: 0
 <6><d08>: Abbrev Number: 0
 <5><d09>: Abbrev Number: 0
 <4><d0a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <d0f>   DW_AT_byte_size   : 4
    <d10>   DW_AT_alignment   : 4
 <5><d11>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <d12>   DW_AT_type        : <0x78de>
    <d16>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><d1a>: Abbrev Number: 0
 <4><d1b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <d20>   DW_AT_byte_size   : 4
    <d21>   DW_AT_alignment   : 4
 <5><d22>: Abbrev Number: 12 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <d27>   DW_AT_type        : <0x78de>
    <d2b>   DW_AT_alignment   : 4
    <d2c>   DW_AT_data_member_location: 0
 <5><d2d>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <d2e>   DW_AT_type        : <0x78de>
    <d32>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><d36>: Abbrev Number: 0
 <4><d37>: Abbrev Number: 21 (DW_TAG_subprogram)
    <d38>   DW_AT_linkage_name: (indirect string, offset: 0xfd07): _ZN4core6option15Option$LT$T$GT$3map17h9770d5576e9c3fafE
    <d3c>   DW_AT_name        : (indirect string, offset: 0x10596): map<&rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>,bool,closure-0>
    <d40>   DW_AT_decl_file   : 7
    <d41>   DW_AT_decl_line   : 485
    <d43>   DW_AT_type        : <0xdde>
    <d47>   DW_AT_inline      : 1	(inlined)
 <5><d48>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <d49>   DW_AT_type        : <0x78de>
    <d4d>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><d51>: Abbrev Number: 18 (DW_TAG_template_type_param)
    <d52>   DW_AT_type        : <0x81df>
    <d56>   DW_AT_name        : (indirect string, offset: 0x5128): U
 <5><d5a>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <d5b>   DW_AT_type        : <0x62de>
    <d5f>   DW_AT_name        : (indirect string, offset: 0x74b3): F
 <5><d63>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <d64>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <d68>   DW_AT_decl_file   : 7
    <d69>   DW_AT_decl_line   : 485
    <d6b>   DW_AT_type        : <0xcdb>
 <5><d6f>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <d70>   DW_AT_name        : (indirect string, offset: 0x2164): f
    <d74>   DW_AT_decl_file   : 7
    <d75>   DW_AT_decl_line   : 485
    <d77>   DW_AT_type        : <0x62de>
 <5><d7b>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <6><d7c>: Abbrev Number: 23 (DW_TAG_variable)
    <d7d>   DW_AT_name        : (indirect string, offset: 0xbf5e): x
    <d81>   DW_AT_decl_file   : 7
    <d82>   DW_AT_decl_line   : 487
    <d84>   DW_AT_type        : <0x78de>
 <6><d88>: Abbrev Number: 0
 <5><d89>: Abbrev Number: 0
 <4><d8a>: Abbrev Number: 21 (DW_TAG_subprogram)
    <d8b>   DW_AT_linkage_name: (indirect string, offset: 0xe551): _ZN4core6option15Option$LT$T$GT$3map17hfce721f35a9bbe5dE
    <d8f>   DW_AT_name        : (indirect string, offset: 0x13ee): map<&rtic::tq::NotReady<rtic::cyccnt::CYCCNT, nucleo_rtic_blinking_led::APP::T0>,rtic::cyccnt::Instant,closure-0>
    <d93>   DW_AT_decl_file   : 7
    <d94>   DW_AT_decl_line   : 485
    <d96>   DW_AT_type        : <0xf53>
    <d9a>   DW_AT_inline      : 1	(inlined)
 <5><d9b>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <d9c>   DW_AT_type        : <0x78de>
    <da0>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><da4>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <da5>   DW_AT_type        : <0x5b33>
    <da9>   DW_AT_name        : (indirect string, offset: 0x5128): U
 <5><dad>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <dae>   DW_AT_type        : <0x6388>
    <db2>   DW_AT_name        : (indirect string, offset: 0x74b3): F
 <5><db6>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <db7>   DW_AT_name        : (indirect string, offset: 0xaeed): self
    <dbb>   DW_AT_decl_file   : 7
    <dbc>   DW_AT_decl_line   : 485
    <dbe>   DW_AT_type        : <0xcdb>
 <5><dc2>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <dc3>   DW_AT_name        : (indirect string, offset: 0x2164): f
    <dc7>   DW_AT_decl_file   : 7
    <dc8>   DW_AT_decl_line   : 485
    <dca>   DW_AT_type        : <0x6388>
 <5><dce>: Abbrev Number: 22 (DW_TAG_lexical_block)
 <6><dcf>: Abbrev Number: 23 (DW_TAG_variable)
    <dd0>   DW_AT_name        : (indirect string, offset: 0xbf5e): x
    <dd4>   DW_AT_decl_file   : 7
    <dd5>   DW_AT_decl_line   : 487
    <dd7>   DW_AT_type        : <0x78de>
 <6><ddb>: Abbrev Number: 0
 <5><ddc>: Abbrev Number: 0
 <4><ddd>: Abbrev Number: 0
 <3><dde>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x2aae): Option<bool>
    <de3>   DW_AT_byte_size   : 1
    <de4>   DW_AT_alignment   : 1
 <4><de5>: Abbrev Number: 33 (DW_TAG_variant_part)
    <de6>   DW_AT_discr       : <0xdea>
 <5><dea>: Abbrev Number: 34 (DW_TAG_member)
    <deb>   DW_AT_type        : <0x58f2>
    <def>   DW_AT_alignment   : 1
    <df0>   DW_AT_data_member_location: 0
    <df1>   DW_AT_artificial  : 1
 <5><df1>: Abbrev Number: 35 (DW_TAG_variant)
    <df2>   DW_AT_discr_value : 2
 <6><df3>: Abbrev Number: 12 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <df8>   DW_AT_type        : <0xe0d>
    <dfc>   DW_AT_alignment   : 1
    <dfd>   DW_AT_data_member_location: 0
 <6><dfe>: Abbrev Number: 0
 <5><dff>: Abbrev Number: 36 (DW_TAG_variant)
 <6><e00>: Abbrev Number: 12 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <e05>   DW_AT_type        : <0xe1e>
    <e09>   DW_AT_alignment   : 1
    <e0a>   DW_AT_data_member_location: 0
 <6><e0b>: Abbrev Number: 0
 <5><e0c>: Abbrev Number: 0
 <4><e0d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e0e>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <e12>   DW_AT_byte_size   : 1
    <e13>   DW_AT_alignment   : 1
 <5><e14>: Abbrev Number: 18 (DW_TAG_template_type_param)
    <e15>   DW_AT_type        : <0x81df>
    <e19>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><e1d>: Abbrev Number: 0
 <4><e1e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <e23>   DW_AT_byte_size   : 1
    <e24>   DW_AT_alignment   : 1
 <5><e25>: Abbrev Number: 37 (DW_TAG_member)
    <e26>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <e2a>   DW_AT_type        : <0x81df>
    <e2e>   DW_AT_alignment   : 1
    <e2f>   DW_AT_data_member_location: 0
 <5><e30>: Abbrev Number: 18 (DW_TAG_template_type_param)
    <e31>   DW_AT_type        : <0x81df>
    <e35>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><e39>: Abbrev Number: 0
 <4><e3a>: Abbrev Number: 0
 <3><e3b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x4264): Option<(nucleo_rtic_blinking_led::APP::R0_P1_S0_T, u8)>
    <e40>   DW_AT_byte_size   : 2
    <e41>   DW_AT_alignment   : 1
 <4><e42>: Abbrev Number: 33 (DW_TAG_variant_part)
    <e43>   DW_AT_discr       : <0xe47>
 <5><e47>: Abbrev Number: 34 (DW_TAG_member)
    <e48>   DW_AT_type        : <0x58f2>
    <e4c>   DW_AT_alignment   : 1
    <e4d>   DW_AT_data_member_location: 0
    <e4e>   DW_AT_artificial  : 1
 <5><e4e>: Abbrev Number: 35 (DW_TAG_variant)
    <e4f>   DW_AT_discr_value : 2
 <6><e50>: Abbrev Number: 12 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <e55>   DW_AT_type        : <0xe6a>
    <e59>   DW_AT_alignment   : 1
    <e5a>   DW_AT_data_member_location: 0
 <6><e5b>: Abbrev Number: 0
 <5><e5c>: Abbrev Number: 36 (DW_TAG_variant)
 <6><e5d>: Abbrev Number: 12 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <e62>   DW_AT_type        : <0xe7b>
    <e66>   DW_AT_alignment   : 1
    <e67>   DW_AT_data_member_location: 0
 <6><e68>: Abbrev Number: 0
 <5><e69>: Abbrev Number: 0
 <4><e6a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e6b>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <e6f>   DW_AT_byte_size   : 2
    <e70>   DW_AT_alignment   : 1
 <5><e71>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <e72>   DW_AT_type        : <0x6782>
    <e76>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><e7a>: Abbrev Number: 0
 <4><e7b>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <e80>   DW_AT_byte_size   : 2
    <e81>   DW_AT_alignment   : 1
 <5><e82>: Abbrev Number: 12 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <e87>   DW_AT_type        : <0x6782>
    <e8b>   DW_AT_alignment   : 1
    <e8c>   DW_AT_data_member_location: 0
 <5><e8d>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <e8e>   DW_AT_type        : <0x6782>
    <e92>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><e96>: Abbrev Number: 0
 <4><e97>: Abbrev Number: 0
 <3><e98>: Abbrev Number: 7 (DW_TAG_structure_type)
    <e99>   DW_AT_name        : (indirect string, offset: 0xb8e8): Option<u8>
    <e9d>   DW_AT_byte_size   : 2
    <e9e>   DW_AT_alignment   : 1
 <4><e9f>: Abbrev Number: 33 (DW_TAG_variant_part)
    <ea0>   DW_AT_discr       : <0xea4>
 <5><ea4>: Abbrev Number: 34 (DW_TAG_member)
    <ea5>   DW_AT_type        : <0x58f2>
    <ea9>   DW_AT_alignment   : 1
    <eaa>   DW_AT_data_member_location: 0
    <eab>   DW_AT_artificial  : 1
 <5><eab>: Abbrev Number: 35 (DW_TAG_variant)
    <eac>   DW_AT_discr_value : 0
 <6><ead>: Abbrev Number: 12 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <eb2>   DW_AT_type        : <0xec8>
    <eb6>   DW_AT_alignment   : 1
    <eb7>   DW_AT_data_member_location: 0
 <6><eb8>: Abbrev Number: 0
 <5><eb9>: Abbrev Number: 35 (DW_TAG_variant)
    <eba>   DW_AT_discr_value : 1
 <6><ebb>: Abbrev Number: 12 (DW_TAG_member)
    <ebc>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <ec0>   DW_AT_type        : <0xed9>
    <ec4>   DW_AT_alignment   : 1
    <ec5>   DW_AT_data_member_location: 0
 <6><ec6>: Abbrev Number: 0
 <5><ec7>: Abbrev Number: 0
 <4><ec8>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ec9>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <ecd>   DW_AT_byte_size   : 2
    <ece>   DW_AT_alignment   : 1
 <5><ecf>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <ed0>   DW_AT_type        : <0x58f2>
    <ed4>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><ed8>: Abbrev Number: 0
 <4><ed9>: Abbrev Number: 7 (DW_TAG_structure_type)
    <eda>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <ede>   DW_AT_byte_size   : 2
    <edf>   DW_AT_alignment   : 1
 <5><ee0>: Abbrev Number: 12 (DW_TAG_member)
    <ee1>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <ee5>   DW_AT_type        : <0x58f2>
    <ee9>   DW_AT_alignment   : 1
    <eea>   DW_AT_data_member_location: 1
 <5><eeb>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <eec>   DW_AT_type        : <0x58f2>
    <ef0>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><ef4>: Abbrev Number: 0
 <4><ef5>: Abbrev Number: 0
 <3><ef6>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x3ded): Option<(nucleo_rtic_blinking_led::APP::T0, u8)>
    <efb>   DW_AT_byte_size   : 2
    <efc>   DW_AT_alignment   : 1
 <4><efd>: Abbrev Number: 33 (DW_TAG_variant_part)
    <efe>   DW_AT_discr       : <0xf02>
 <5><f02>: Abbrev Number: 34 (DW_TAG_member)
    <f03>   DW_AT_type        : <0x58f2>
    <f07>   DW_AT_alignment   : 1
    <f08>   DW_AT_data_member_location: 0
    <f09>   DW_AT_artificial  : 1
 <5><f09>: Abbrev Number: 35 (DW_TAG_variant)
    <f0a>   DW_AT_discr_value : 2
 <6><f0b>: Abbrev Number: 12 (DW_TAG_member)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <f10>   DW_AT_type        : <0xf25>
    <f14>   DW_AT_alignment   : 1
    <f15>   DW_AT_data_member_location: 0
 <6><f16>: Abbrev Number: 0
 <5><f17>: Abbrev Number: 36 (DW_TAG_variant)
 <6><f18>: Abbrev Number: 12 (DW_TAG_member)
    <f19>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <f1d>   DW_AT_type        : <0xf36>
    <f21>   DW_AT_alignment   : 1
    <f22>   DW_AT_data_member_location: 0
 <6><f23>: Abbrev Number: 0
 <5><f24>: Abbrev Number: 0
 <4><f25>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f26>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <f2a>   DW_AT_byte_size   : 2
    <f2b>   DW_AT_alignment   : 1
 <5><f2c>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <f2d>   DW_AT_type        : <0x7e25>
    <f31>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><f35>: Abbrev Number: 0
 <4><f36>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f37>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <f3b>   DW_AT_byte_size   : 2
    <f3c>   DW_AT_alignment   : 1
 <5><f3d>: Abbrev Number: 12 (DW_TAG_member)
    <f3e>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <f42>   DW_AT_type        : <0x7e25>
    <f46>   DW_AT_alignment   : 1
    <f47>   DW_AT_data_member_location: 0
 <5><f48>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <f49>   DW_AT_type        : <0x7e25>
    <f4d>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><f51>: Abbrev Number: 0
 <4><f52>: Abbrev Number: 0
 <3><f53>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f54>   DW_AT_name        : (indirect string, offset: 0x8f87): Option<rtic::cyccnt::Instant>
    <f58>   DW_AT_byte_size   : 8
    <f59>   DW_AT_alignment   : 4
 <4><f5a>: Abbrev Number: 33 (DW_TAG_variant_part)
    <f5b>   DW_AT_discr       : <0xf5f>
 <5><f5f>: Abbrev Number: 34 (DW_TAG_member)
    <f60>   DW_AT_type        : <0x789f>
    <f64>   DW_AT_alignment   : 4
    <f65>   DW_AT_data_member_location: 0
    <f66>   DW_AT_artificial  : 1
 <5><f66>: Abbrev Number: 35 (DW_TAG_variant)
    <f67>   DW_AT_discr_value : 0
 <6><f68>: Abbrev Number: 12 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <f6d>   DW_AT_type        : <0xf83>
    <f71>   DW_AT_alignment   : 4
    <f72>   DW_AT_data_member_location: 0
 <6><f73>: Abbrev Number: 0
 <5><f74>: Abbrev Number: 35 (DW_TAG_variant)
    <f75>   DW_AT_discr_value : 1
 <6><f76>: Abbrev Number: 12 (DW_TAG_member)
    <f77>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <f7b>   DW_AT_type        : <0xf94>
    <f7f>   DW_AT_alignment   : 4
    <f80>   DW_AT_data_member_location: 0
 <6><f81>: Abbrev Number: 0
 <5><f82>: Abbrev Number: 0
 <4><f83>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f84>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <f88>   DW_AT_byte_size   : 8
    <f89>   DW_AT_alignment   : 4
 <5><f8a>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <f8b>   DW_AT_type        : <0x5b33>
    <f8f>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><f93>: Abbrev Number: 0
 <4><f94>: Abbrev Number: 7 (DW_TAG_structure_type)
    <f95>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <f99>   DW_AT_byte_size   : 8
    <f9a>   DW_AT_alignment   : 4
 <5><f9b>: Abbrev Number: 12 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xcdfa): __0
    <fa0>   DW_AT_type        : <0x5b33>
    <fa4>   DW_AT_alignment   : 4
    <fa5>   DW_AT_data_member_location: 4
 <5><fa6>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <fa7>   DW_AT_type        : <0x5b33>
    <fab>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><faf>: Abbrev Number: 0
 <4><fb0>: Abbrev Number: 0
 <3><fb1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <fb2>   DW_AT_name        : (indirect string, offset: 0xe7a): Option<usize>
    <fb6>   DW_AT_byte_size   : 8
    <fb7>   DW_AT_alignment   : 4
 <4><fb8>: Abbrev Number: 33 (DW_TAG_variant_part)
    <fb9>   DW_AT_discr       : <0xfbd>
 <5><fbd>: Abbrev Number: 34 (DW_TAG_member)
    <fbe>   DW_AT_type        : <0x789f>
    <fc2>   DW_AT_alignment   : 4
    <fc3>   DW_AT_data_member_location: 0
    <fc4>   DW_AT_artificial  : 1
 <5><fc4>: Abbrev Number: 35 (DW_TAG_variant)
    <fc5>   DW_AT_discr_value : 0
 <6><fc6>: Abbrev Number: 12 (DW_TAG_member)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <fcb>   DW_AT_type        : <0xfe1>
    <fcf>   DW_AT_alignment   : 4
    <fd0>   DW_AT_data_member_location: 0
 <6><fd1>: Abbrev Number: 0
 <5><fd2>: Abbrev Number: 35 (DW_TAG_variant)
    <fd3>   DW_AT_discr_value : 1
 <6><fd4>: Abbrev Number: 12 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x5340): Some
    <fd9>   DW_AT_type        : <0xff2>
    <fdd>   DW_AT_alignment   : 4
    <fde>   DW_AT_data_member_location: 0
 <6><fdf>: Abbrev Number: 0
 <5><fe0>: Abbrev Number: 0
 <4><fe1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x5e43): None
    <fe6>   DW_AT_byte_size   : 8
    <fe7>   DW_AT_alignment   : 4
 <5><fe8>: Abbrev Number: 13 (DW_TAG_template_type_param)
    <fe9>   DW_AT_type        : <0x67a0>
    <fed>   DW_AT_name        : (indirect string, offset: 0x1f1f): T
 <5><ff1>: Abbrev Number: 0
 <4><ff2>: Abbrev Number: 7 (DW_TAG_structure_type)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x5340): Some
